In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.random.randn(5,4),
                 columns=['c1','c2','c3','c4'])
df
df.loc[[0,1],'c1'] = None
df.loc[2,'c2'] = None
df

         c1        c2        c3        c4
0       NaN  1.627808 -0.760223 -1.337639
1       NaN  1.184806 -2.255430 -1.724712
2  1.272340       NaN  0.485531 -1.257624
3  0.124119  0.695832 -0.435844 -0.622166
4  1.200672  1.034337 -0.038051  0.285884

In [3]:
# 결측값이 있는 행 제거
df.dropna(axis = 0)

         c1        c2        c3        c4
3  0.124119  0.695832 -0.435844 -0.622166
4  1.200672  1.034337 -0.038051  0.285884

In [4]:
# 결측값이 있는 열 전체 제거
df.dropna(axis=1)

         c3        c4
0 -0.760223 -1.337639
1 -2.255430 -1.724712
2  0.485531 -1.257624
3 -0.435844 -0.622166
4 -0.038051  0.285884

In [5]:
# c1열에 대해 결측값이 있는 행을 제거
print(df)
df['c1'].dropna()

         c1        c2        c3        c4
0       NaN  1.627808 -0.760223 -1.337639
1       NaN  1.184806 -2.255430 -1.724712
2  1.272340       NaN  0.485531 -1.257624
3  0.124119  0.695832 -0.435844 -0.622166
4  1.200672  1.034337 -0.038051  0.285884

2    1.272340
3    0.124119
4    1.200672
Name: c1, dtype: float64

In [6]:
df[['c1','c2','c3']].dropna()

         c1        c2        c3
3  0.124119  0.695832 -0.435844
4  1.200672  1.034337 -0.038051

In [7]:
df[['c1','c2','c3']].dropna(axis=1)

         c3
0 -0.760223
1 -2.255430
2  0.485531
3 -0.435844
4 -0.038051

In [ ]:
# df에서 2,4번 행에대해 c1,c2,c3열에 대해 na가 있는 행 데이터 제거
# 0.244007 -> 0.092419 -> -1.67884 출력

In [10]:
df.loc[[2,4],['c1','c2','c3']].dropna(axis=0)

         c1        c2        c3
4  1.200672  1.034337 -0.038051

In [11]:
df[['c1','c2','c3']].dropna(axis=1)

         c3
0 -0.760223
1 -2.255430
2  0.485531
3 -0.435844
4 -0.038051

In [12]:
# interpolate함수 : 결측값을 보간(선형적으로 값에 비례하는 방식)
# 1 nan nan 7 -> 1 3 5 7